[
  {
    "id": 1,
    "title": "Building Authentic Personal Brands That Command Attention",
    "excerpt": "In today's competitive landscape, personal branding is the difference between being invisible and unforgettable. Discover the strategic framework for building authority.",
    "content": "Your personal brand is more than a logo or tagline—it's the reputation you build through consistent action, messaging, and value delivery. When strategically positioned, it transforms how your market perceives you, opens doors to opportunities, and establishes you as someone worth knowing and doing business with.",
    "author": "Industry Expert",
    "date": "2026-01-22",
    "category": "Personal Branding",
    "featured": true,
    "image": "https://images.unsplash.com/photo-1552664730-d307ca884978?w=600&h=400&fit=crop",
    "isFeatured": true
  },
  {
    "id": 2,
    "title": "The Strategic Visibility Playbook for Entrepreneurs",
    "excerpt": "Visibility isn't random—it's strategic. Learn how successful entrepreneurs position themselves in front of the right people at the right time.",
    "content": "Strategic visibility means showing up consistently where your ideal customers and partners are already paying attention. From content marketing to speaking engagements, visibility creates opportunity. The entrepreneurs who master this see measurable growth in leads, partnerships, and market influence.",
    "author": "Growth Strategist",
    "date": "2026-01-20",
    "category": "Business Strategy",
    "featured": false,
    "image": "https://images.unsplash.com/photo-1552664730-d307ca884978?w=600&h=400&fit=crop"
  },
  {
    "id": 3,
    "title": "Storytelling: The Business Asset That Actually Pays Dividends",
    "excerpt": "Data and features don't sell—stories do. Learn why the most successful brands are master storytellers and how to craft narratives that resonate.",
    "content": "Every memorable brand has a compelling narrative. Rather than drowning audiences in features and benefits, successful brands tell stories that create emotional connections. From origin stories to customer success narratives, strategic storytelling builds loyalty, trust, and preference.",
    "author": "Marketing Lead",
    "date": "2026-01-18",
    "category": "Marketing & Communications",
    "featured": false,
    "image": "https://images.unsplash.com/photo-1552664730-d307ca884978?w=600&h=400&fit=crop"
  },
  {
    "id": 4,
    "title": "Becoming a Sought-After Expert: The Thought Leadership Edge",
    "excerpt": "Thought leadership isn't about knowing everything—it's about sharing meaningful insights consistently. Here's how to build authority in your field.",
    "content": "When you consistently share valuable perspectives and insights in your industry, you become a go-to resource. This positions you as an authority, attracts inbound opportunities, and creates doors you didn't know existed. Thought leadership is a long-term investment that pays compounding returns.",
    "author": "Industry Authority",
    "date": "2026-01-15",
    "category": "Thought Leadership",
    "featured": false,
    "image": "https://images.unsplash.com/photo-1552664730-d307ca884978?w=600&h=400&fit=crop"
  },
  {
    "id": 5,
    "title": "Content Strategy That Actually Moves the Needle",
    "excerpt": "One-off content rarely delivers results. Discover why consistent, strategic content is the foundation of sustainable business growth.",
    "content": "Consistent, intentional content builds momentum. Rather than sporadic posting, a strategic content approach delivers ongoing value, builds trust, establishes authority, and keeps you top-of-mind when opportunities arise.",
    "author": "Content Strategist",
    "date": "2026-01-12",
    "category": "Business Strategy",
    "featured": false,
    "image": "https://images.unsplash.com/photo-1552664730-d307ca884978?w=600&h=400&fit=crop"
  },
  {
    "id": 6,
    "title": "Why Investors Back Stories, Not Just Business Plans",
    "excerpt": "Investors fund founders and the narratives they believe in. Learn how to craft a compelling founder story that attracts capital and support.",
    "content": "Capital doesn't just flow to the best product—it flows to compelling visions backed by credible founders. Your founder story, personal brand, and ability to articulate your vision are often more important than the business plan itself.",
    "author": "Business Advisor",
    "date": "2026-01-10",
    "category": "Entrepreneurship",
    "featured": false,
    "image": "https://images.unsplash.com/photo-1552664730-d307ca884978?w=600&h=400&fit=crop"
  }
]
